회의시간 : 0318 20:00 ~ 21:34

- RaspberryPi TouchScreen 사용
    - 앱을 사용한건 어떤가?
    - App inventor 사용, 이러면 파이어베이스를 쓰는게 어떤가
- 색깔로 원래는 루트가 정해져 있지만 초심자들은 생각보다 길 찾기를 어려워함
- MG996 모터?
- 기울어진 벽 3D를 2D로 매핑시켜서 이미지 학습을 하자
- 라즈베리파이 저장공간
    - https://makeutil.tistory.com/254
- 시나리오 짜기

## 0320

![image.png](attachment:67b6a320-c99c-4d8c-8e2b-ebcd7a0ac764:image.png)

- 초보자는 큰 홀드에서 어딜 짚어야 하는지를 잘 모름
    - 홀드 감지에 추가해서 어딜 짚고 어딜 밟아야 하는지
- (x,y,z) 좌표 구하기
    - 삼각측량법으로 두 개의 레이저(빛의 속도와 시간을 이용한 거리 계산)를 사용
    - 각도를 계산해서 좌표점을 구하기
    - ToF센서 사용?
- 손, 발을 어디다  두어야 할지에 대한 문제
